#include <avr/interrupt.h>

void adc_init() //инициализация АЦП
{
  ADMUX = (1 << REFS0 ); //настраивается опорное напряжение +5 В
  ADCSRA = (1 << ADEN) | (1 << ADPS2 ) | (1 << ADPS1) | (1 << ADPS0); // включение АЦП; настройка делителя 128
}

void setup()
{
  adc_init();
  DDRB |= (1 << PB1); //Подключение сигнала на сервопривод
  TCCR1A = (1 << COM1A1) | (1 << WGM11); // неинвертирующий ШИМ на OC1A, включение режима 14 Fast PWM
  TCCR1B = (1 << WGM12) | (1 << WGM13) | (1 << CS11 ); // включние режима 14 Fast PWM, установка делителя 8
  ICR1 = 39999; // период 20 мс
  OCR1A = 1999; // импульс 1 мс
}

unsigned int adc_read() //чтение данных с АЦП
{
  ADCSRA |= (1 << ADSC); //запуск измерения
  while (ADCSRA & (1 << ADSC)); //пока флаг не сбросится в 0 ждём
  return ADC; // возвращается измерение
}



void loop() {
  unsigned int adc = adc_read(); //измерение считывается
  OCR1A = 1999 + ((unsigned long)adc * 2000 / 1023); //новое положение для сервопривода 1999 + доля * 2000: adc 0 = −90°, 1023 = +90°.
}
