#include <avr/interrupt.h>

unsigned int count = 0; //счётчик прерываний
unsigned int number = 0; //счётчик режимов

void setup()
{
  DDRB |= (1 << PB1); //Подключение сигнала на сервопривод
  TCCR1A = (1 << COM1A1) | (1 << WGM11); // неинвертирующий ШИМ на OC1A, включение режима 14 Fast PWM
  TCCR1B = (1 << WGM12) | (1 << WGM13) | (1 << CS11 ); // включние режима 14 Fast PWM, установка делителя 8
  ICR1 = 39999; // период 20 мс
  OCR1A = 1999; // импульс 1 мс
  TIMSK1 = (1 << TOIE1); //ращрешение прерывания каждые 20 мс
  sei();

}

ISR(TIMER1_OVF_vect) {
  int arr[] = {1999, 2999, 3999}; //три режима сервоприрода -90, 0, +90
  count++; //считаем каждое прерывание до смены режима
  if (count == 50) { //при достижении 50 прерываний режим сменяется
    count = 0;
    number++; //прибавляется, потому что мы в setup() начали с 0 эл массива, избегаем повторения
    if (number == 3)//если выходит за пределы массива начинаем сначала
      number = 0;
    OCR1A = arr[number]; //переключаем режим
  }
}

void loop() {}
